Synwit-Co-Ltd/SWM330_Lib/WDT/SimplWDT_Interrupt/APP/main.c
#include "SWM330.h"


void SerialInit(void);

int main(void)
{	
	SystemInit();
	
	SerialInit();
	
	WDT_Init(WDT, 1024, 0);
	WDT_Start(WDT);
	
	while(1==1)
	{
	}
}

void WDT_Handler(void)
{
	WDT_INTClr(WDT);
	
	printf("WDT Interrupt happened\r\n");
}


void SerialInit(void)
{
	UART_InitStructure UART_initStruct;
	
	PORT_Init(PORTA, PIN6, FUNMUX0_UART0_TXD, 0);
	PORT_Init(PORTA, PIN7, FUNMUX1_UART0_RXD, 1);
 	
 	UART_initStruct.Baudrate = 57600;
	UART_initStruct.DataBits = UART_DATA_8BIT;
	UART_initStruct.Parity = UART_PARITY_NONE;
	UART_initStruct.StopBits = UART_STOP_1BIT;
	UART_initStruct.RXThresholdIEn = 0;
	UART_initStruct.TXThresholdIEn = 0;
	UART_initStruct.TimeoutIEn = 0;
 	UART_Init(UART0, &UART_initStruct);
	UART_Open(UART0);
}

int fputc(int ch, FILE *f)
{
	UART_WriteByte(UART0, ch);
	
	while(UART_IsTXBusy(UART0));
 	
	return ch;
}
